from telegram import (
    Update,
    LabeledPrice,
    InlineKeyboardButton,
    InlineKeyboardMarkup,
)
from telegram.ext import ContextTypes

async def show_clues_callback(update: Update, context: ContextTypes.DEFAULT_TYPE):
    query = update.callback_query
    await query.answer()

    await query.message.edit_text(
        "💡 Подсказки:\n\n"
        "Подсказки помогут тебе понять быстрее что за персонаж загадан!\n"
        "Существует 3 вида подсказок:\n"
        "1)Hard - абстрактный факт,который максимально обще будет описать персонажа(Цена: 5✨)\n"
        "2)Meduim - факты,который поймет любитель и профессионалы,но не многие новички(Цена: 10✨)\n"
        "3)Easy - факт,который будет понятен даже новичкам!(Цена: 20✨)\n"
        "Ниже ты можешь заранее выбрать подсказка,какая будет в игре. Если-же у вас нет подсказок,то их можно приобрести в личном кабинете в главном меню.",
        reply_markup=InlineKeyboardMarkup([
            [InlineKeyboardButton("⬅️ Назад", callback_data="back_to_room")]
        ])
    )